Repository: silviupescaru/ServiceAuto_ClientServer
Catalog: ServiceAuto_Client/ServiceAuto_Client/Language/string.*.resx
Languages: fr

# buttonAdd
source: Add
fr: Ajouter

# buttonBack
source: Back to Manager
fr: Retour au gestionnaire

# buttonDelete
source: Delete
fr: Supprimer

# buttonLogin
source: Login
fr: Se connecter

# buttonLogout
source: Logout
fr: Se déconnecter

# buttonSaveCSV
source: Save CSV
fr: Sauvegarder CSV

# buttonSaveDOC
source: Save DOC
fr: Sauvegarder DOC

# buttonSaveJSON
source: Save JSON
fr: Sauvegarder JSON

# buttonSaveXML
source: Save XML
fr: Sauvegarder XML

# buttonSearch
source: Search
fr: Recherche

# buttonStatistics
source: Statistics
fr: Statistiques

# buttonUpdate
source: Update
fr: Mise à jour

# buttonViewAll
source: View All
fr: Voir tout

# labelBrand
source: Brand
fr: Marque

# labelCarID
source: Car ID
fr: ID Voiture

# labelChangeLanguage
source: Change Language
fr: Changer de langue

# labelColor
source: Color
fr: Couleur

# labelCriterion
source: Criterion
fr: Critère

# labelFilterBy
source: Filter By
fr: Filtrer par

# labelFuel
source: Fuel
fr: Carburant

# labelHeader
source: Cars Information
fr: Informations sur les voitures

# labelLoggedAdmin
source: Logged in as Administrator
fr: Connecté en tant qu'administrateur

# labelLoggedIn
source: Logged in as Employee
fr: Connecté en tant qu'employé

# labelLoggedManager
source: Logged in as Manager
fr: Connecté en tant que Manager

# labelOrderBy
source: Car Order By
fr: Commande de voiture par

# labelOwner
source: Owner
fr: Propriétaire

# labelPassword
source: Password
fr: Mot de passe

# labelRole
source: Role
fr: Rôle

# labelSearch
source: Search Bar
fr: Barre de recherche

# labelSearchRole
source: Search Role
fr: Rôle de recherche

# labelUserID
source: User ID
fr: ID de l'utilisateur

# labelUsername
source: Username
fr: Nom d'utilisateur

# messageBoxAddFail
source: Adding ended with failure!
fr: L’ajout a échoué!

# messageBoxAddSuccess
source: Adding was successful!
fr: L’ajout a réussi!

# messageBoxCarIDNonZero
source: Car ID must be non-zero natural number!
fr: L’ID de la voiture doit être un nombre naturel non nul!

# messageBoxDeleteFail
source: Deleting ended with failure!
fr: La suppression a échoué!

# messageBoxDeleteSuccess
source: Deleting was successful!
fr: La suppression a réussi!

# messageBoxFileSaveSuccess
source: File saved successfully!
fr: Fichier enregistré avec succès!

# messageBoxNoCarDesiredOwner
source: No car with desired owner!
fr: Aucune donnée avec le propriétaire souhaité!

# messageBoxNoData
source: There is no data in your table!
fr: Il n’y a pas de données dans votre tableau!

# messageBoxNoDataDesiredFilter
source: The data from desired filter is empty!
fr: Les données du filtre souhaité sont vides!

# messageBoxNoDataSelected
source: No data has been selected to be updated!
fr: Aucune donnée n’a été sélectionnée pour être mise à jour!

# messageBoxNoDataSelectedDelete
source: No data has been selected to be deleted!
fr: Aucune donnée n'a été sélectionnée pour être supprimée !

# messageBoxNoUserDesiredRole
source: No user with desired role!
fr: Aucun utilisateur avec le rôle souhaité!

# messageBoxOwnerEmpty
source: Car Owner is empty!
fr: Le propriétaire de la voiture est vide!

# messageBoxPasswordEmpty
source: Password is empty!
fr: Le mot de passe est vide!

# messageBoxRoleEmpty
source: Role is empty!
fr: Le rôle est vide!

# messageBoxSearchEmpty
source: Search Bar is empty!
fr: La barre de recherche est vide!

# messageBoxUpdateFail
source: Updating ended with failure!
fr: La mise à jour a échoué!

# messageBoxUpdateSucess
source: Updating was successful!
fr: La mise à jour a réussi!

# messageBoxUserIDNonZero
source: User ID must be non-zero natural number!
fr: L’ID de l’utilisateur doit être un nombre naturel non nul!

# messageBoxUsernameEmpty
source: Username is empty!
fr: Le nom d’utilisateur est vide!
